
# Rの基本｜RとStanではじめる ベイズ統計モデリングによるデータ分析入門
# 馬場真哉


# RStudioの使い方 -------------------------------------------------------------

1 + 1
3 - 1
3 * 4
8 / 6
2 ^ 10

# これは実行されない
# 1 + 1


# 変数 ----------------------------------------------------------------------

# 変数の定義
x <- 2

# 変数を使った計算
x + 1


# 関数 ----------------------------------------------------------------------

# 平方根をとる
sqrt(4)


# ベクトル --------------------------------------------------------------------

# ベクトルの作成
vector_1 <- c(1,2,3,4,5)

vector_1

# 等差数列
1:10



# 行列 ----------------------------------------------------------------------

# 行列の作成
matrix_1 <- matrix(
  data = 1:10,    # データ
  nrow = 2,       # 2行にする
  byrow = TRUE    # 行(横)の順番でデータを格納する
)

matrix_1

# 行名と列名を変える
rownames(matrix_1) <- c("Row1", "Row2")
colnames(matrix_1) <- c("Col1", "Col2", "Col3", "Col4", "Col5")

matrix_1


# 配列 ----------------------------------------------------------------------

# 配列の作成
array_1 <- array(
  data = 1:30,    # データ
  dim = c(3,5,2)  # (行数、列数、行列の数)
)

array_1

# データフレーム -----------------------------------------------------------------

# データフレームの作成
data_frame_1 <- data.frame(
  col1 = c("A", "B", "C", "D", "E"),
  col2 = c(1, 2, 3, 4, 5)
)

data_frame_1

# 行数
nrow(data_frame_1)


# リスト(list) ---------------------------------------------------------------

# リストの作成
list_1 <- list(
  chara = c("A", "B", "C"),
  matrix = matrix_1,
  df = data_frame_1
)

list_1


# データの抽出 ------------------------------------------------------------------

# vectorの特定の値を取得
vector_1[1]

# matrixの場合は2次元で指定する
matrix_1[1,2]

# arrayの場合は3次元で指定する
array_1[1,2,1]

# 特定行を取得
matrix_1[1,]

# 特定列を取得
matrix_1[,1]

# 特定の範囲を取得
matrix_1[1,2:4]

# 要素数などを調べる
dim(matrix_1)
dim(array_1)

# 行名と列名
dimnames(matrix_1)

# 行名と列名を指定してデータを抽出する
matrix_1["Row1", "Col1"]

# 特定の列を抽出
data_frame_1$col2

# 特定の列の特定の要素を抽出
data_frame_1$col2[2]

# 先頭行を取得
head(data_frame_1, n = 2)

# listの場合の抽出方法
list_1$chara
list_1[[1]]


# 時系列データ：ts ---------------------------------------------------------------

# もととなるデータフレーム
data_frame_2 <- data.frame(
  data = 1:24
)

# 時系列データに変換
ts_1 <- ts(
  data_frame_2,      # 対象データ
  start = c(2010,1), # 開始年月
  frequency = 12     # 1年におけるデータの数(頻度)
)


ts_1

# ファイルからのデータの読み込み ----------------------------------------------------------------

# CSVファイルを読み込む
birds <- read.csv("2-1-1-birds.csv")
head(birds, n = 3)

# 乱数の生成 -------------------------------------------------------------------

# 平均0、標準偏差1の正規分布に従う乱数を1つ取得
# 1回目
rnorm(n = 1, mean = 0, sd = 1)
# 2回目
rnorm(n = 1, mean = 0, sd = 1)

# 乱数の固定
set.seed(1)
rnorm(n = 1, mean = 0, sd = 1)
set.seed(1)
rnorm(n = 1, mean = 0, sd = 1)

# 乱数の固定
set.seed(1)
rnorm(n = 1, mean = 0, sd = 1)
rnorm(n = 1, mean = 0, sd = 1)
set.seed(1)
rnorm(n = 1, mean = 0, sd = 1)
rnorm(n = 1, mean = 0, sd = 1)



# 繰り返し構文とforループ ------------------------------------------------------------------

# forループの基本
for (i in 1:3){
  print(i)
}

# 要素番号を変えながら実行
result_vec_1 <- c(0, 0, 0) # 結果を保存する入れ物
set.seed(1)                # 乱数の種
for (i in 1:3){
  result_vec_1[i] <- rnorm(n = 1, mean = 0, sd = 1)
}

result_vec_1


# 要素番号を変えながら実行
result_vec_2 <- c(0, 0, 0) # 結果を保存する入れ物
mean_vec <- c(0, 10, -5)   # 平均値を指定したベクトル
set.seed(1)                # 乱数の種
for (i in 1:3){
  result_vec_2[i] <- rnorm(n = 1, mean = mean_vec[i], sd = 1)
}

result_vec_2


# 外部パッケージの活用 --------------------------------------------------------------

install.packages("tidyverse")
library(tidyverse)





